# 4.9 Python Visualization Part 2

#### This script contains the following:
1. Importing libraries
2. Importing data
3. Data wrangling
4. Data quality and consistency checks
5. Merging data
6. Exporting data

### 1. Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### 2. Importing Data

In [2]:
# 3) Number 3 of task 4.9: Importing data

path = r'C:\Users\keely\Documents\Courses\CareerFoundry\Immersion\Achievement 4 - Python\01-2023 Instacart Basket Analysis'

In [3]:
# Importing final orders_products_merged_flags.pkl data set.

df_ords_prods_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_flags_price_alt.pkl'))

In [4]:
# Importing new customers data set

df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

### 3. Data Wrangling

In [5]:
pd.options.display.max_columns = None

In [6]:
# 4) Number 4 of task 4.9:

df_ords_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,price_label,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spent,spending_flag,med_days_since_prior_order,order_frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,Mid-range product,Regularly busy,Regularly busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [7]:
# Ensuring previous removal of erroneous high item prices were removed.

df_ords_prods_merged['prices'].max()

25.0

In [8]:
df_ords_prods_merged.shape

(32404859, 24)

In [9]:
df_ords_prods_merged.dtypes

order_id                       object
user_id                        object
order_number                    int16
orders_day_of_week               int8
order_hour_of_day                int8
days_since_prior_order        float16
new_customer                     bool
product_id                      int32
add_to_cart_order               int16
reordered                        int8
product_name                   object
aisle_id                        int16
department_id                    int8
prices                        float32
price_label                    object
busiest_day                    object
busiest_days                   object
busiest_period_of_day          object
max_order                       int16
loyalty_flag                   object
avg_spent                     float32
spending_flag                  object
med_days_since_prior_order    float16
order_frequency_flag           object
dtype: object

In [10]:
df_customers.head()

,Unnamed: 0,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
df_customers.shape

(206209, 9)

In [12]:
# Looking at max income value to determine best data type for this variable later in script.

df_customers['income'].max()

593901

In [13]:
df_customers.describe()

,Unnamed: 0,user_id,Age,n_dependants,income
count,206209.000000,206209.000000,206209.000000,206209.000000,206209.000000
mean,103104.000000,103105.000000,49.501646,1.499823,94632.852548
std,59527.555167,59527.555167,18.480962,1.118433,42473.786988
min,0.000000,1.000000,18.000000,0.000000,25903.000000
25%,51552.000000,51553.000000,33.000000,0.000000,59874.000000
50%,103104.000000,103105.000000,49.000000,1.000000,93547.000000
75%,154656.000000,154657.000000,66.000000,3.000000,124244.000000
max,206208.000000,206209.000000,81.000000,3.000000,593901.000000

In [14]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    206209 non-null  int64
 1   user_id       206209 non-null  int64
 2   Gender        206209 non-null  object
 3   STATE         206209 non-null  object
 4   Age           206209 non-null  int64
 5   date_joined   206209 non-null  object
 6   n_dependants  206209 non-null  int64
 7   fam_status    206209 non-null  object
 8   income        206209 non-null  int64
dtypes: int64(5), object(4)
memory usage: 14.2+ MB

In [15]:
# Changing data types as part of wrangling in hopes of reducing issues during future merge.

df_customers['user_id'] = df_customers['user_id'].astype('str')

df_customers['Age'] = df_customers['Age'].astype('int8')

df_customers['n_dependants'] = df_customers['n_dependants'].astype('int8')

df_customers['income'] = df_customers['income'].astype('int32')

In [12]:
# Did not drop any df_customers columns on second run of script. This allows more flexibility in final analysis in 
# task 4.10.

# Dropping two columns I don't think are needed for the analysis.

#df_customers.drop(columns = ['Gender', 'fam_status'], inplace=True)

In [16]:
df_customers.drop(columns = ['Unnamed: 0',], inplace=True)

In [17]:
# Changing column names to something more intuitive.

df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [18]:
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [19]:
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [20]:
df_customers.rename(columns = {'n_dependants' : 'no_children'}, inplace = True)

In [21]:
df_customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [22]:
df_customers.head()

,user_id,gender,state,age,date_joined,no_children,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

### 4. Data Quality & Consistency Checks

In [23]:
# 5) Number 5 in task 4.9

# Checking for mixed data types:

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

user_id  consistent
gender  consistent
state  consistent
age  consistent
date_joined  consistent
no_children  consistent
marital_status  consistent
income  consistent

In [24]:
# Finding missing values in df_customers:

df_customers.isnull().sum()

user_id           0
gender            0
state             0
age               0
date_joined       0
no_children       0
marital_status    0
income            0
dtype: int64

In [25]:
# Finding duplicates

df_customers_dups = df_customers[df_customers.duplicated()]

df_customers_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, no_children, marital_status, income]
Index: []

In [26]:
df_customers.shape

(206209, 8)

### 5. Merging Data

In [27]:
# 6) Number 6 in task 4.9

# Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are 
# the same data type!)

# Seeing if df_ords_prods_merged had columns in common with df_customers.

df_ords_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,price_label,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spent,spending_flag,med_days_since_prior_order,order_frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,Mid-range product,Regularly busy,Regularly busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [28]:
# Checking if data types are the same in both dataframes for user_id columns. 
# Answer: both were previously integers, but one is int16 and one int64, now both are strings.

df_ords_prods_merged.dtypes

order_id                       object
user_id                        object
order_number                    int16
orders_day_of_week               int8
order_hour_of_day                int8
days_since_prior_order        float16
new_customer                     bool
product_id                      int32
add_to_cart_order               int16
reordered                        int8
product_name                   object
aisle_id                        int16
department_id                    int8
prices                        float32
price_label                    object
busiest_day                    object
busiest_days                   object
busiest_period_of_day          object
max_order                       int16
loyalty_flag                   object
avg_spent                     float32
spending_flag                  object
med_days_since_prior_order    float16
order_frequency_flag           object
dtype: object

In [29]:
df_customers.dtypes

user_id           object
gender            object
state             object
age                 int8
date_joined       object
no_children         int8
marital_status    object
income             int32
dtype: object

In [30]:
pd.options.display.max_columns = None

In [31]:
df_ords_prods_merged.shape

(32404859, 24)

In [32]:
df_customers.head()

,user_id,gender,state,age,date_joined,no_children,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [33]:
df_customers.shape

(206209, 8)

In [34]:
# Performing inner merge.

df_ords_prods_cust = df_ords_prods_merged.merge(df_customers, on = ['user_id'], how = 'inner')

In [35]:
df_ords_prods_cust.shape

(32404859, 31)

### 6. Exporting Merged Data Set

In [36]:
# 6) Number 6 in task 4.9: Export merged data set.

# Export final dataframe to pickle format.

df_ords_prods_cust.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_custs_merged.pkl'))